[
  {
    "_id": "640c2dd963a319ea671e367e",
    "name": "Butter",
    "desc": "A dairy product made from churning cream or milk, with a high fat content and a creamy, rich flavor that is often used in cooking and baking.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e367e.png"
  },
  {
    "_id": "640c2dd963a319ea671e3687",
    "name": "Caster Sugar",
    "desc": "A type of fine sugar that is commonly used in baking and cooking, with a fine texture that dissolves easily, and is often used in recipes that require quick mixing or dissolving, such as meringues, whipped cream, and cakes.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3687.png"
  },
  {
    "_id": "640c2dd963a319ea671e3762",
    "name": "Self-raising Flour",
    "desc": "Self-raising flour is a type of flour that has a leavening agent, usually baking powder, already added to it. This allows baked goods to rise without the need for yeast or other leavening agents.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3762.png"
  },
  {
    "_id": "640c2dd963a319ea671e3814",
    "name": "Almonds",
    "desc": "A type of nut with a sweet and nutty flavor, commonly used in baking and as a snack.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3814.png"
  },
  {
    "_id": "640c2dd963a319ea671e3665",
    "name": "Baking Powder",
    "desc": "Baking powder is a dry chemical leavening agent, a mixture of a carbonate or bicarbonate and a weak acid. The base and acid are prevented from reacting prematurely by the inclusion of a buffer such as cornstarch. Baking powder is used to increase the volume and lighten the texture of baked goods. It works by releasing carbon dioxide gas into a batter or dough through an acid-base reaction, causing bubbles in the wet mixture to expand and thus leavening the mixture. The first single-acting baking powder was developed by Birmingham based food manufacturer Alfred Bird in England in 1843. The first double-acting baking powder was developed by Eben Norton Horsford in America in the 1860s.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3665.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ca",
    "name": "Eggs",
    "desc": "A reproductive cell laid by female animals, often used in baking and cooking as a binding agent or to add texture and flavor",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e36ca.png"
  },
  {
    "_id": "640c2dd963a319ea671e3786",
    "name": "Vanilla Extract",
    "desc": "A concentrated liquid extract made from vanilla beans and alcohol, commonly used to add vanilla flavor to baked goods and desserts.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3786.png"
  },
  {
    "_id": "640c2dd963a319ea671e3861",
    "name": "Almond Extract",
    "desc": "The almond (Prunus dulcis, syn. Prunus amygdalus) is a species of tree native to Mediterranean climate regions of the Middle East, but widely cultivated elsewhere. The almond is also the name of the edible and widely cultivated seed of this tree. Within the genus Prunus, it is classified with the peach in the subgenus Amygdalus, distinguished from the other subgenera by corrugations on the shell (endocarp) surrounding the seed.\r\n\r\nThe fruit of the almond is a drupe, consisting of an outer hull and a hard shell with the seed, which is not a true nut, inside. Shelling almonds refers to removing the shell to reveal the seed. Almonds are sold shelled or unshelled. Blanched almonds are shelled almonds that have been treated with hot water to soften the seedcoat, which is then removed to reveal the white embryo.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e3861.png"
  },
  {
    "_id": "640c2dd963a319ea671e380f",
    "name": "Pink Food Colouring",
    "desc": "A type of food coloring used to add a pale pink color to foods and drinks.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e380f.png"
  },
  {
    "_id": "640c2dd963a319ea671e37bf",
    "name": "Apricot",
    "desc": "Fruit with a soft, velvety skin and a sweet, juicy flesh, commonly eaten fresh or dried.",
    "img": "https://ftp.goit.study/img/so-yummy/ingredients/640c2dd963a319ea671e37bf.png"
  }
]
